app/controllers/complaints_controller.rb

SELECT "complaints".* FROM "complaints"
---
  def index
    @complaints = Complaint.all

INSERT INTO "complaints" ("title", "text", "category", "company", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "fgdgdfg"], ["text", "gdfg"], ["category", "gdfgfd"], ["company", "greyrty"], ["user_id", 1], ["created_at", "2020-09-16 05:36:59.808719"], ["updated_at", "2020-09-16 05:36:59.808719"]]
---
  def create
    @complaint = Complaint.new(complaint_params)

    @complaint.write_attribute(:user_id, current_user.id)
    respond_to do |format|
      if @complaint.save

UPDATE "complaints" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "complaints"."id" = ?  [["title", "a"], ["text", "a"], ["updated_at", "2020-09-16 09:07:20.506657"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @complaint.update(complaint_params)

DELETE FROM "complaints" WHERE "complaints"."id" = ?  [["id", 1]]
---
  def destroy
    @complaint.destroy

SELECT "complaints".* FROM "complaints" WHERE "complaints"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_complaint
      @complaint = Complaint.find(params[:id])