app/controllers/home_controller.rb

  def index
  @complaints = Complaint.all
---
SELECT "complaints".* FROM "complaints"

  def search
    @complaints = Complaint.search(params[:search], params[:search_company])
---
SELECT "complaints".* FROM "complaints" WHERE "complaints"."complaint_id" = ?  [["complaint_id", 4]]