app/controllers/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "marcos"], ["LIMIT", 1]]
---
  def create
    user = User.find_by_username(params[:username])