app/models/complaint.rb

SELECT "complaints".* FROM "complaints" WHERE "complaints"."title" = ? AND "complaints"."company" = ? LIMIT ?  [["title", "b"], ["company", "b"], ["LIMIT", 1]]
---
    def self.search(search, search_company)
        if search and search_company
            complaint = Complaint.find_by(title: search, company: search_company)